of70/tutorials/rheoInterFoam/damBreak/Newtonian/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
      parameters
       {		        
         type            Newtonian;
         rho             rho [1 -3 0 0 0 0 0] 1000;
         eta             eta [1 -1 -1 0 0 0 0] 0.001;  
       }
}

air
{
     parameters
       {		        
         type            Newtonian;
         rho             rho [1 -3 0 0 0 0 0] 1;
         eta             eta [1 -1 -1 0 0 0 0] 1.48e-5;  
       }
}
 

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.07;

// ************************************************************************* //
